IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/UART6.xml
	<register id="MEM_ISR2" acronym="MEM_ISR2" offset="0x70" width="32" description="Status of  RX/TX FIFOs empty corresponding interrupts.">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="6" begin="7" end="2" resetval="0x0" description="" range="7 - 2" rwaccess="R"/> 
		<bitfield id="TXFIFO_EMPTY_STS" width="1" begin="1" end="1" resetval="0x1" description="TXFIFO interrupt pending" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="RXFIFO_EMPTY_STS" width="1" begin="0" end="0" resetval="0x1" description="RXFIFO interrupt pending" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_FREQ_SEL" acronym="MEM_FREQ_SEL" offset="0x74" width="32" description="Sample per bit value selector">
		<bitfield id="FREQ_SEL" width="8" begin="7" end="0" resetval="0x26" description="Sets the sample per bit if non default frequency is used. MDR3[1] must be set to 1 after this value is set. Must be equal or higher then 6." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_ABAUD_1ST_CHAR" acronym="MEM_ABAUD_1ST_CHAR" offset="0x78" width="32" description="Unused">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_BAUD_2ND_CHAR" acronym="MEM_BAUD_2ND_CHAR" offset="0x7C" width="32" description="Unused">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_MDR3" acronym="MEM_MDR3" offset="0x80" width="32" description="Mode definition register 3.">
		<bitfield id="RESERVED2" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="DIR_EN" width="1" begin="4" end="4" resetval="0x0" description="RS-485 External Transceiver Direction Enable" range="4" rwaccess="R/W"/> 
		<bitfield id="DIR_POL" width="1" begin="3" end="3" resetval="0x0" description="RS-485 External Transceiver Direction Polarity. 0 => TX: RTS=0, RX: RTS=1. 1 => TX: RTS=1, RX: RTS=0" range="3" rwaccess="R/W"/> 
		<bitfield id="SET_DMA_TX_THRESHOLD" width="1" begin="2" end="2" resetval="0x0" description="Enable to set different TX DMA threshold then 64-trigger [usage of new register TX_DNA_THRESHOLD]" range="2" rwaccess="R/W"/> 
		<bitfield id="NONDEFAULT_FREQ" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/Disables[0] using NONDEFAULT  fclk frequencies" range="1" rwaccess="R/W"/> 
		<bitfield id="DISABLE_CIR_RX_DEMOD" width="1" begin="0" end="0" resetval="0x0" description="Disables[1]/Enables[0] CIR RX demodulation" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_TX_DMA_THRESHOLD" acronym="MEM_TX_DMA_THRESHOLD" offset="0x84" width="32" description="Use to manually set the TX DMA threshold level.
MDR3[2] SET_TX_DMA_THRESHOLD must be one and 
must be value + tx_trigger_level &#60;= 64 (TX FIFO size).
If not, 64-tx_trigger_level will be used w/o modifying 
the value of this register.">
		<bitfield id="TX_DMA_THRESHOLD" width="6" begin="5" end="0" resetval="0x0" description="Use to manually set the TX DMA threshold level." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MDR4" acronym="MEM_MDR4" offset="0x88" width="32" description="Mode definition register 4">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="MODE9" width="1" begin="6" end="6" resetval="0x0" description="9-bit character length. When '1', overrides character length setting in LCR" range="6" rwaccess="R/W"/> 
		<bitfield id="FREQ_SEL_H" width="3" begin="5" end="3" resetval="0x0" description="Upper 3 bits of FREQ_SEL register for higher division values, as required for example for FI/Di in ISO7816 mode" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="New modes [when set, overrides MDR1 modes]" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_EFR2" acronym="MEM_EFR2" offset="0x8C" width="32" description="Enhanced Features Register 2">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="BROADCAST" width="1" begin="7" end="7" resetval="0x0" description="Enables broadcast address matching in multi-drop address match mode" range="7" rwaccess="R/W"/> 
		<bitfield id="TIMEOUT_BEHAVE" width="1" begin="6" end="6" resetval="0x0" description="Specifies how timeout is measured" range="6" rwaccess="R/W"/> 
		<bitfield id="C8" width="1" begin="5" end="5" resetval="0x0" description="Value for ISO 7816 C8 pin for software control" range="5" rwaccess="R/W"/> 
		<bitfield id="C4" width="1" begin="4" end="4" resetval="0x0" description="Value for ISO 7816 C4 pin for software control" range="4" rwaccess="R/W"/> 
		<bitfield id="C2" width="1" begin="3" end="3" resetval="0x0" description="Value for ISO 7816 reset pin [software controllable]" range="3" rwaccess="R/W"/> 
		<bitfield id="MULTIDROP" width="1" begin="2" end="2" resetval="0x0" description="Enables parity Multi-drop mode [overrides LCR[5..3]] when '1'" range="2" rwaccess="R/W"/> 
		<bitfield id="RHR_OVERRUN" width="1" begin="1" end="1" resetval="0x0" description="RHR Overrun behaviour when buffer full" range="1" rwaccess="R/W"/> 
		<bitfield id="ENDIAN" width="1" begin="0" end="0" resetval="0x0" description="Endianness" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_ECR" acronym="MEM_ECR" offset="0x90" width="32" description="Enhanced Control register">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R"/> 
		<bitfield id="CLEAR_TX_PE" width="1" begin="5" end="5" resetval="0x0" description="Write 1 to clear parity error from the Transmitter to allow it to continue to try sending data [ISO7816 transmit only]" range="5" rwaccess="W"/> 
		<bitfield id="TX_EN" width="1" begin="4" end="4" resetval="0x1" description="Enables/Disables the transmitter" range="4" rwaccess="R/W"/> 
		<bitfield id="RX_EN" width="1" begin="3" end="3" resetval="0x1" description="Enables/Disables the receiver" range="3" rwaccess="R/W"/> 
		<bitfield id="TX_RST" width="1" begin="2" end="2" resetval="0x0" description="Writing '1' resets the transmitter" range="2" rwaccess="W"/> 
		<bitfield id="RX_RST" width="1" begin="1" end="1" resetval="0x0" description="Writing '1' resets the receiver" range="1" rwaccess="W"/> 
		<bitfield id="A_MULTIDROP" width="1" begin="0" end="0" resetval="0x0" description="In multi-drop mode, when written with the value '1' causes the next byte written into THR to be transmitted with the parity bit set, signaling an address" range="0" rwaccess="W"/>
	</register>
